Repository: oddava/finance-tracker
Catalog: bot/locales/*/LC_MESSAGES/messages.po
Languages: ru, uz

source: Expense logged!
ru: Расходы зарегистрированы!
uz: Xarajat saqlandi!

source: ❌ Failed to save expense. Please try again.
ru: ❌ Не удалось сохранить данные о расходах. Пожалуйста, попробуйте еще раз.
uz: ❌ Xarajatni saqlashda xatolik. Iltimos qayta urinib ko'ring.

source: Income logged!
ru: Доход зарегистрирован!
uz: Daromad saqlandi

source: ❌ Failed to save income. Please try again.
ru: ❌ Не удалось сохранить данные о доходах. Пожалуйста, попробуйте еще раз.
uz: Daromadni saqlashda xatolik yuz berdi. Qaytadan urinib ko'ring

source: Please create categories first using /categories
ru: Пожалуйста, сначала создайте категории с помощью команды /categories.
uz: Iltimos, avval /categories yordamida kategoriyalar yarating

source: Expense
ru: Расходы
uz: Xarajatlar

source: Income
ru: Доход
uz: Daromad

source: Select the correct category:
ru: Выберите правильную категорию:
uz: To'g'ri kategoriyani tanlang:

source: 🤔 <b>I couldn't understand that clearly.</b> <b>Try these formats:</b> • <code>50k taxi</code> - Quick expense • <code>lunch 25000</code> - Amount first or last • <code>bought groceries 120k</code> - With description • <code>received 5k from freelance</code> - For income
ru: 🤔 <b>Я не совсем это понял.</b> <b>Попробуйте использовать следующие форматы:</b> • <code>50k такси</code> - Быстрая запись расхода • <code>обед 25000</code> - Сумма в начале или в конце • <code>купил продукты 120k</code> - С описанием • <code>получил 5k от фриланса</code> - Для учета дохода
uz: 🤔 <b>Men buni aniq tushuna olmadim.</b> <b>Ushbu formatlarni sinab ko'ring:</b> • <code>50 minglik taksi</code> - Tezkor xarajat • <code>tushlik 25000</code> - Birinchi yoki oxirgi summa • <code>120 minglik oziq-ovqat mahsulotlari sotib olindi</code> - Tavsif bilan • <code>frilanserdan 600 ming qabul qilindi</code> - Daromad uchun

source: ❌ <b>Unexpected error occurred</b> Please try again or contact support if the issue persists.
ru: ❌ <b>Произошла непредвиденная ошибка</b> Пожалуйста, повторите попытку или обратитесь в службу поддержки, если проблема сохранится.
uz: ❌ <b>Kutilmagan xatolik yuz berdi</b> Agar muammo davom etsa, qayta urinib ko'ring yoki qo'llab-quvvatlash xizmatiga murojaat qiling.

source: ⚠️ Session expired. Please try again.
ru: ⚠️ Срок действия сеанса истек. Пожалуйста, попробуйте еще раз.
uz: ⚠️ Sessiya tugadi. Iltimos, qaytadan urinib ko'ring.

source: ❌ Category not found
ru: ❌ Категория не найдена
uz: ❌ Kategoriya topilmadi

source: logged
ru: зарегистрирован
uz: Saqlandi

source: ✅ Saved!
ru: ✅ Сохранено!
uz: ✅ Saqlandi!

source: ❌ Invalid category
ru: ❌ Неверная категория
uz: ❌ Noto'g'ri kategoriya

source: 📊 No expenses recorded today.
ru: 📊 Сегодня расходы не зафиксированы.
uz: 📊 Bugun hech qanday xarajatlar qayd etilmadi.

source: Today's Expenses
ru: Сегодняшние расходы
uz: Bugungi xarajatlar

source: Total
ru: Общий
uz: Jami

source: Transactions
ru: Транзакции
uz: Tranzaksiyalar

source: Recent transactions
ru: Недавние транзакции
uz: So'nggi tranzaksiyalar

source: 📊 No transactions yet. Start by logging your first expense!
ru: 📊 Транзакций пока нет. Начните с регистрации вашей первой траты!
uz: 📊 Hali hech qanday tranzaksiya yo'q. Birinchi xarajatlaringizni qayd etishdan boshlang!

source: Recent Transactions
ru: Недавние транзакции
uz: So'nggi tranzaksiyalar

source: 🌍 <b>Select Language</b> Current: {language}
ru: 🌍 <b>Выберите язык</b> Текущий: {language}
uz: 🌍 <b>Tilni tanlang</b> Hozirgi til: {language}

source: ✅ Language changed to {new_language}! You can change it anytime in /settings
ru: ✅ Язык изменен на {new language}! Вы можете изменить его в любое время в разделе /settings
uz: ✅ Til {new_language} ga o'zgartirildi! Siz uni istalgan vaqtda /settings bo'limida o'zgartirishingiz mumkin

source: 🌍 <b>Select Language Current: {language}
ru: 🌍 <b>Выберите язык Текущий: {language}
uz: 🌍 <b>Tilni tanlang Hozirgi til: {language}

source: ⚙️ <b>Settings</b> Current configuration: 🌍 Language: {language} 💱 Currency: {currency} 🕐 Timezone: {timezone} What would you like to change?
ru: ⚙️ <b>Настройки</b> Текущая конфигурация: 🌍 Язык: {language} 💱 Валюта: {currency} 🕐 Часовой пояс: {timezone} Что бы вы хотели изменить?
uz: ⚙️ <b>Sozlamalar</b> Joriy konfiguratsiya: 🌍 Til: {language} 💱 Valyuta: {currency} 🕐 Vaqt mintaqasi: {timezone} Nimani o'zgartirmoqchisiz?

source: 🕐 <b>Select Timezone</b> Current: {timezone} Local time: {time} UTC offset: {offset} Choose a timezone region:
ru: 🕐 <b>Выберите часовой пояс</b> Текущий: {timezone} Местное время: {time} Смещение относительно UTC: {offset} Выберите регион часового пояса:
uz: 🕐 <b>Vaqt mintaqasini tanlang</b> Joriy: {timezone} Mahalliy vaqt: {time} UTC ofset: {offset}

source: 🕐 <b>Select Timezone - {region}</b> Current: {timezone} Choose your city:
ru: 🕐 <b>Выберите часовой пояс - {region}</b> Текущий: {timezone} Выберите свой город:
uz: 🕐 <b>Vaqt mintaqasini tanlang - {region}</b> Joriy: {timezone} Shaharingizni tanlang:

source: ✅ Timezone changed to {timezone}! 🕐 Local time: {time} 📍 UTC offset: {offset} All timestamps will now use this timezone.
ru: ✅ Часовой пояс изменен на {timezone}! 🕐 Местное время: {time} 📍 Смещение относительно UTC: {offset} Теперь все отметки времени будут использовать этот часовой пояс.
uz: ✅ Vaqt mintaqasi {timezone} ga o'zgartirildi! 🕐 Mahalliy vaqt: {time} 📍 UTC ofseti: {offset} Barcha vaqt belgilari endi ushbu vaqt mintaqasidan foydalanadi.

source: 🕐 <b>Select Timezone</b> Current: {timezone} Local time: {time}
ru: 🕐 <b>Выберите часовой пояс</b> Текущий: {timezone} Местное время: {time}
uz: 🕐 <b>Vaqt mintaqasini tanlang</b> Joriy: {timezone} Mahalliy vaqt: {time}

source: What would you like to do? <b>Quick Commands:</b> • Just type: <code>50k taxi</code> • /today - Today's summary • /recent - Recent transactions • /help - About this bot
ru: Что бы вы хотели сделать? <b>Быстрые команды:</b> • Просто введите: <code>50k такси</code> • /today - Сводка за сегодня • /recent - Последние транзакции • /help - О боте
uz: Nima qilmoqchisiz? <b>Tezkor buyruqlar:</b> • Faqat yozing: <code>50k taksi</code> • /today - Bugungi xulosa • /recent - So'nggi tranzaksiyalar • /help - Bu bot haqida

source: Welcome! 💱 <b>First, let's set your currency:</b> Select your preferred currency:
ru: Добро пожаловать! 💱 <b>Сначала выберите валюту:</b> Выберите предпочитаемую валюту:
uz: Xush kelibsiz! 💱 <b>Avval valyutani sozlaymiz:</b> O'zingiz yoqtirgan valyutani tanlang:

source: Perfect! You're all set up. <b>Try your first expense:</b> • Example: <code>50k taxi</code> Let's get started! 🚀
ru: Отлично! Настройка завершена. <b>Попробуйте записать первый расход:</b> • Пример: <code>50k такси</code> Начнем! 🚀
uz: Ajoyib! Hammasi sozlandi. <b>Birinchi xarajatingizni sinab ko'ring:</b> • Misol: <code>50k taksi</code> Boshlaymiz! 🚀

source: ❓ <b>How to use the bot</b> <b>📝 Logging Expenses:</b> • Example: <code>50k taxi</code> • Example: <code>lunch 25000</code> • Example: <code>spent 150 on groceries</code> <b>📊 View Reports:</b> • /today - Today's expenses • /week [soon] - This week's summary • /month [soon] - Monthly breakdown • /recent - Last 10 transactions <b>🎯 Budgets [soon]:</b> • /budget - Set/view budgets • /budgets - All budgets status <b>⚙️ Settings [soon]:</b> • /settings - Change preferences • /currency - Change currency • /categories - Manage categories <b>📈 Analytics [soon]:</b> • /insights - AI-powered insights • /compare - Compare periods • /export - Export data to Excel <b>📚 Other:</b> • /about - About the bot • /feedback - Report issues
ru: ❓ <b>Как использовать бот</b> <b>📝 Учет расходов:</b> • Пример: <code>50k такси</code> • Пример: <code>обед 25000</code> • Пример: <code>потрачено 150 на продукты</code> <b>📊 Просмотр отчетов:</b> • /today - Расходы за сегодня • /week [скоро] - Сводка за неделю • /month [скоро] - Месячная разбивка • /recent - Последние 10 транзакций <b>🎯 Бюджеты [скоро]:</b> • /budget - Установить/просмотреть бюджеты • /budgets - Статус всех бюджетов <b>⚙️ Настройки [скоро]:</b> • /settings - Изменить настройки • /currency - Сменить валюту • /categories - Управление категориями <b>📈 Аналитика [скоро]:</b> • /insights - Аналитика с ИИ • /compare - Сравнение периодов • /export - Экспорт данных в Excel <b>📚 Другое:</b> • /about - О боте • /feedback - Сообщить о проблемах
uz: ❓ <b>Botdan qanday foydalanish</b> <b>📝 Xarajatlarni qayd etish:</b> • Misol: <code>50k taksi</code> • Misol: <code>tushlik 25000</code> • Misol: <code>oziq-ovqatga 150 sarflandi</code> <b>📊 Hisobotlarni ko'rish:</b> • /today - Bugungi xarajatlar • /week [tez orada] - Shu haftalik xulosa • /month [tez orada] - Oylik tahlil • /recent - Oxirgi 10 tranzaksiya <b>🎯 Byudjetlar [tez orada]:</b> • /budget - Byudjetlarni o'rnatish/ko'rish • /budgets - Barcha byudjetlar holati <b>⚙️ Sozlamalar [tez orada]:</b> • /settings - Sozlamalarni o'zgartirish • /currency - Valyutani o'zgartirish • /categories - Kategoriyalarni boshqarish <b>📈 Analitika [tez orada]:</b> • /insights - Sun'iy intellektga asoslangan tahlillar • /compare - Davrlarni solishtirish • /export - Ma'lumotlarni Excelga eksport qilish <b>📚 Boshqalar:</b> • /about - Bot haqida • /feedback - Muammolar haqida xabar berish

source: ℹ️ <b>About Finance Tracker Bot</b> 🤖 Smart personal finance tracking made easy! <b>Your Stats:</b> 📅 Member since: {joined_date} 💰 Currency: {currency} 📝 This month: {monthly_transactions} transactions 💸 Total spent: {total_spent} {currency} <b>Features:</b> ✅ Natural language expense logging ✅ Budget tracking & alerts ✅ Smart insights & analytics ✅ Visual reports & charts ✅ Multiple currencies support ✅ Data export (Excel/CSV) Made with ❤️ Version: 1.0.0
ru: ℹ️ <b>О боте Finance Tracker</b> 🤖 Умный учет личных финансов стал проще! <b>Ваша статистика:</b> 📅 Участник с: {joined_date} 💰 Валюта: {currency} 📝 В этом месяце: {monthly_transactions} транзакций 💸 Всего потрачено: {total_spent} {currency} <b>Функции:</b> ✅ Учет расходов на естественном языке ☑️ Отслеживание бюджета и уведомления ☑️ Умная аналитика и инсайты ☑️ Визуальные отчеты и графики ☑️ Поддержка нескольких валют ☑️ Экспорт данных (Excel/CSV) Сделано с ❤️ Версия: 1.0.0
uz: ℹ️ <b>Finance Tracker Bot haqida</b> 🤖 Shaxsiy moliyaviy hisobni oson boshqarish! <b>Sizning statistikangiz:</b> 📅 Ro'yxatdan o'tgan sana: {joined_date} 💰 Valyuta: {currency} 📝 Shu oyda: {monthly_transactions} tranzaksiyalar 💸 Jami sarflangan: {total_spent} {currency} <b>Xususiyatlar:</b> ✅ Tabiiy tilda xarajat qayd etish ☑️ Byudjetni kuzatish va ogohlantirishlar ☑️ Aqlli tahlillar va analitika ☑️ Vizual hisobotlar va grafiklar ☑️ Bir nechta valyutalarni qo'llab-quvvatlash ☑️ Ma'lumotlarni eksport qilish (Excel/CSV) Made with ❤️ Versiya: 1.0.0

source: 💬 <b>Feedback & Support</b> We'd love to hear from you! 📧 <b>Contact:</b> • Telegram: @notJony 🐛 <b>Report Issues:</b> Found a bug? Let us know! ⭐ <b>Feature Requests:</b> Have an idea? We're listening! 🌟 <b>Rate Us:</b> Enjoying the bot? Share with friends!
ru: 💬 <b>Обратная связь и поддержка</b> Мы будем рады вашим отзывам! 📧 <b>Контакты:</b> • Telegram: @notJony 🐛 <b>Сообщить о проблемах:</b> Нашли ошибку? Дайте нам знать! ⭐ <b>Предложения по функциям:</b> Есть идея? Мы слушаем! 🌟 <b>Оцените нас:</b> Нравится бот? Поделитесь с друзьями!
uz: 💬 <b>Fikr-mulohaza va qo'llab-quvvatlash</b> Sizdan xabar olishni xohlaymiz! 📧 <b>Aloqa:</b> • Telegram: @notJony 🐛 <b>Muammolarni xabar qilish:</b> Xato topdingizmi? Bizga xabar bering! ⭐ <b>Funksiya takliflari:</b> Fikringiz bormi? Biz tinglayapmiz! 🌟 <b>Bizni baholang:</b> Bot sizga yoqdimi? Do'stlaringiz bilan ulashing!

source: 🌍 Language
ru: 🌍 Язык

source: 💱 Currency
ru: 💱 Валюта
uz: 💱 Valyuta

source: 🏷️ Categories
ru: 🏷️ Категории
uz: 🏷️ Kategoriyalar

source: 🎯 Budgets
ru: 🎯 Бюджеты
uz: 🎯 Budjetlar

source: 🔔 Notifications
ru: 🔔 Уведомления
uz: 🔔 Bildirishnomalar

source: 🕐 Timezone
ru: 🕐 Часовой пояс
uz: 🕐 Vaqt mintaqasi

source: 📥 Export Data
ru: 📥 Экспорт данных
uz: 📥 Ma'lumotlarni eksport qilish

source: 🗑️ Delete Account
ru: 🗑️ Удалить аккаунт
uz: 🗑 Akkauntni o'chirish

source: ❌ Close
ru: ❌ Закрыть
uz: ❌ Yopish

source: ✅ Successfully sent broadcast message to <b>{user_count}</b> users. Failed: {failed_count} Blocked: {blocked_count}
ru: ✅ Сообщение успешно отправлено <b>{user_count}</b> пользователям. Не удалось: {failed_count} Заблокировано: {blocked_count}
uz: ✅ Xabar <b>{user_count}</b> foydalanuvchilarga muvaffaqiyatli yuborildi. Muvaffaqiyatsiz: {failed_count} Bloklangan: {blocked_count}

source: 📢 <b>Confirm Broadcast</b> <b>Recipients:</b> {total_users:,} users <b>Message:</b> {text} Send this message to all users?
ru: 📢 <b>Подтверждение рассылки</b> <b>Получатели:</b> {total_users:,} пользователей <b>Сообщение:</b> {text} Отправить это сообщение всем пользователям?
uz: 📢 <b>Rassylkani tasdiqlash</b> <b>Qabul qiluvchilar:</b> {total_users:,} foydalanuvchilar <b>Xabar:</b> {text} Ushbu xabarni barcha foydalanuvchilarga yuborishni xohlaysizmi?

source: 📢 <b>Broadcast Message</b> To send a broadcast message to all users: Use command: <code>/broadcast your message here</code> ⚠️ <b>Warning:</b> This will send the message to ALL users!
ru: 📢 <b>Сообщение для рассылки</b> Чтобы отправить сообщение всем пользователям: Используйте команду: <code>/broadcast ваше сообщение здесь</code> ⚠️ <b>Предупреждение:</b> Это отправит сообщение ВСЕМ пользователям!
uz: 📢 <b>Rassylka xabari</b> Barcha foydalanuvchilarga xabar yuborish uchun: Buyruqdan foydalaning: <code>/broadcast bu yerga xabaringizni yozing</code> ⚠️ <b>Ogohlantirish:</b> Bu xabar BARCHA foydalanuvchilarga yuboriladi!
